# Tap
tap "homebrew/cask-fonts"

# Dev
brew 'rustup'
brew 'solana'
brew 'node'
brew 'yarn'
brew 'pngquant'
brew 'go'
brew 'symfony-cli/tap/symfony-cli'

# UI/UX
brew 'walk' # https://github.com/antonmedv/walk
brew 'starship' # https://starship.rs/
brew tree

# Apps
cask 'zed'
cask 'rustrover' # JetBrains Rust IDE (free for now)
cask 'rectangle'
cask 'gimp'
cask 'brave-browser'
cask 'visual-studio-code'
cask 'sublime-text'
cask 'mos' # Manage windows with keyboard
cask 'alt-tab' # A better alt-tab solution to hide Finder when no Finder windows are open
cask "font-mononoki-nerd-font" # Install mononoki font

# Perso
cask 'signal'