# Dev
brew 'node'
brew 'yarn'
brew 'go'
brew 'symfony-cli/tap/symfony-cli'
brew 'pulumi/tap/pulumi'
cask 'docker'
cask 'visual-studio-code@insiders' # Insiders version for AI related new features
cask 'zed'
cask 'unnaturalscrollwheels' # To invert Mouse scroll idenpendently from the Trackpad
cask 'ghostty' # Terminal emulator

# UI/UX
cask 'font-mononoki-nerd-font' # Install mononoki font
brew 'starship' # https://starship.rs/
brew 'tree'
brew 'duti' # Command-line tool to manage file associations

# Apps
cask 'rectangle'
cask 'brave-browser'
cask 'alt-tab' # A better alt-tab solution to hide Finder when no Finder windows are open
cask 'vlc' # VLC media player

# Personal
cask 'signal'
cask 'proton-pass'
