# Tap
tap 'homebrew/cask-fonts'
brew 'pulumi/tap/pulumi'

# Dev
brew 'rustup'
brew 'node'
brew 'yarn'
brew 'pngquant'
brew 'go'
brew 'symfony-cli/tap/symfony-cli'
cask 'docker'
cask 'visual-studio-code'
cask 'visual-studio-code@insiders' # Also add insiders version for AI related new features
cask 'zed'
cask 'rustrover' # JetBrains Rust IDE (free for now)
cask 'superwhisper' # AI powered voice to text
brew 'unnaturalscrollwheels' # To invert Mouse scroll idenpendently from the Trackpad
cask 'google-cloud-sdk' # gcloud CLI (https://cloud.google.com/sdk/docs/install-sdk)
cask 'ghostty' # Terminal emulator

# UI/UX
brew 'walk' # https://github.com/antonmedv/walk
brew 'starship' # https://starship.rs/
brew 'tree'
brew 'duti' # Command-line tool to manage file associations

# Apps
cask 'rectangle'
cask 'gimp'
cask 'brave-browser'
cask 'alt-tab' # A better alt-tab solution to hide Finder when no Finder windows are open
cask "font-mononoki-nerd-font" # Install mononoki font
cask 'vlc' # VLC media player

# Personal
cask 'signal'